# Домашня робота №14 "Добуток чисел" з курсу "Python Basic"
#   завдання — написати програму, яка перемножує всі цифри, введені користувачем цілого числа,
# поки воно не стане менше або дорівнювати 9.
# Користувач вводить число з клавіатури.
#  Приклади:
#   999 -> 2
#  Ось чому - 999 розбиваємо на цифри і перемножуємо 9 * 9 * 9 = 729,
#  Потім 7 * 2 * 9 = 126, потім 1 * 2 * 6 = 12 і в результаті 1 * 2 = 2
#   1000 -> 0
#   423 -> 8
#   33 -> 9
#   25 -> 0
#   1 -> 1
number = input('Введіть число:')
num_lst = list(number) # розбиваємо рядок на окремі літери (цифри) в новому списку
while True:
    dig_str = '*'.join(num_lst) # збираємо літери список знову в рядок
    # добавляючи символ '*' мім ними
    mult = eval(dig_str) # застосовуємо фунцію обчислення виразу в сформованому рядкові
    if mult <= 9:
        break
    num_lst = list(str(mult))# якщо цикл не завершився, перетворюємо отриманий результат в рядок
print(mult)
