# Домашня робота №11 "Модифікований калькулятор" (див роботу №4)
# Програма має виконувати прості математичні дії (+, -, *, /).
# Користувачеві пропонується почерзі ввести числа та дію над цими числами,
# а програма, виходячи з дії, обчислює та друкує результат.
# Зробити перевірку на те, що при діленні дільник не дорівнює 0!
# Модифікувати калькулятор таким чином, щоб він працював доти, доки користувач цього хоче
# Тобто, потрібно робити запит до користувача на продовження роботи калькулятора
# після кожного обчислення - якщо користувач ввів yes (можна просто y), то нове обчислення,
# інакше - закінчення роботи.
print("Найпростіший калькулятор")
str = 'yes'
while (str in ['yes','y']):
    num_1 = int(input("Введіть перше число    :"))
    num_2 = int(input("Введіть друге число    :"))
    opr = input("Введіть дію над числами:")
    if opr == '+':
        print("Сумма цих чисел складає:", num_1 + num_2)
    elif opr == '-':
        print("Різниця цих чисел      :", num_1 - num_2)
    elif opr == '*':
        print("Добуток цих чисел      :", num_1*num_2)
    elif opr == '/' and num_2:
        print("Частка  цих чисел      :", num_1/num_2)
    elif num_2 == 0:
        print("На нуль ділити не можна!")
    str = input("Продовжити?").lower()
