# Домашня робота №7 із курсу "Python Basic"
# Написати програму, яка переміщає всі нулі у кінець списку.
# завдання — змінити список так, щоб усі нулі опинилися наприкінці списку.
# Порядок ненульових чисел має зберегтися!
# Приклад:
# [0, 1, 0, 12, 3] -> [1, 12, 3, 0, 0]
# [0] -> [0]
# [1, 0, 13, 0, 0, 0, 5] -> [1, 13, 5, 0, 0, 0, 0]
# [9, 0, 7, 31, 0, 45, 0, 45, 0, 45, 0, 0, 96, 0] -> [9, 7, 31, 45, 45, 45, 96, 0, 0, 0, 0, 0, 0, 0]
# Робити запит на введення даних від користувача не потрібно.
lst = [9, 0, 7, 31, 0, 45, 0, 45, 0, 45, 0, 0, 96, 0]
ind = 0  # змінна індексу у списку значень lst
for ls in lst:
    if not lst[ind]:
        lst.append(lst.pop(ind))# якщо елемент списку нульовий видаляемо його и одразуж додаємо
                                 # в кінець списку
        ind -= 1 # при цьому слід врахувати зміну в індексації списку
                 # внаслідок видалення елементу
    ind += 1
print(lst)
