# Домашня робота №15 "Конвертер із числа в дату" з курсу "Python Basic"
#  Завдання — написати програму, яка переводить число у формат часу у читальному вигляді.
#   - Користувач повинен ввести число більше або дорівнює 0 і менше ніж 8640000.
#   - Число, яке є кількістю секунд, необхідно перевести в дні, години, хвилини та секунди.
#   Додатковим завданням є виведення:
#   Слово "день" підбирається на основі кількох днів,
#   а години, хвилини і секунди повинні заповнюватися нулями при одноцифрових значеннях.
# Приклад:
#       0 -> 0 днів, 00:00:00
#       224930 -> 2 дні, 14:28:50
#       466289 -> 5 днів, 09:31:29
#       950400 -> 11 днів, 00:00:00
#       1209600 -> 14 днів, 00:00:00
#       1900800 - > 22 дні, 00:00:00
#       8639999 -> 99 днів, 23:59:59
#       22493 -> 0 днів, 06:14:53
#       7948799 -> 91 день, 23:59:59
# Використовуючи функцію divmod або методи поділу // і %
# необхідно знайти відповідну кількість днів, годин, хвилин, а те що залишиться - це секунди, які менше 60
# Доповнити провідними нулями можна за допомогою методу zfill()
days_title = {
 0: 'днів', 1: 'день', 2: 'дні', 3: 'дні', 4: 'днів', 5: 'днів', 6: 'днів', 7: 'днів', 8: 'днів', 9: 'днів',
 10: 'днів', 11: 'днів', 12: 'днів', 13: 'днів', 14: 'днів', 15: 'днів', 16: 'днів', 17: 'днів', 18: 'днів', 19: 'днів',
 20: 'днів', 21: 'день', 22: 'дні', 23: 'дні', 24: 'дня', 25: 'днів', 26: 'днів', 27: 'днів', 28: 'днів', 29: 'днів',
 30: 'днів', 31: 'день', 32: 'дні', 33: 'дні', 34: 'дня', 35: 'днів', 36: 'днів', 37: 'днів', 38: 'днів', 39: 'днів',
 40: 'днів', 41: 'день', 42: 'дні', 43: 'дні', 44: 'дня', 45: 'днів', 46: 'днів', 47: 'днів', 48: 'днів', 49: 'днів',
 50: 'днів', 51: 'день', 52: 'дні', 53: 'дні', 54: 'дня', 55: 'днів', 56: 'днів', 57: 'днів', 58: 'днів', 59: 'днів',
 60: 'днів', 61: 'день', 62: 'дні', 63: 'дні', 64: 'дня', 65: 'днів', 66: 'днів', 67: 'днів', 68: 'днів', 69: 'днів',
 70: 'днів', 71: 'день', 72: 'дні', 73: 'дні', 74: 'дня', 75: 'днів', 76: 'днів', 77: 'днів', 78: 'днів', 79: 'днів',
 80: 'днів', 81: 'день', 82: 'дні', 83: 'дні', 84: 'дня', 85: 'днів', 86: 'днів', 87: 'днів', 88: 'днів', 89: 'днів',
 90: 'днів', 91: 'день', 92: 'дні', 93: 'дні', 94: 'дня', 95: 'днів', 96: 'днів', 97: 'днів', 98: 'днів', 99: 'днів'
}
seconds = int(input('Введіть число (кількість секунд): \n'))
if 0 <= seconds < 8640000:
    days, seconds = divmod(seconds, (60 * 60 * 24))
    hours, seconds = divmod(seconds, 60 * 60)
    minutes, seconds = divmod(seconds, 60)
    print(
     days, ' ', days_title[days], ', ',
     str(hours).zfill(2), ':',
     str(minutes).zfill(2), ':',
     str(seconds).zfill(2), sep=''
    )
