# Домашня робота №8 із курсу "Python Basic"
# Для списку цілих чисел потрібно знайти суму елементів із парними індексами
# [0-й, 2-й, 4-й ітд], потім перемножити цю суму на останній елемент вхідного масиву.
# Для порожнього масиву результат завжди 0.
# Пояснення:
# [0, 1, 7, 2, 4, 8] => (0 + 7 + 4) * 8 = 88
# [1, 3, 5] => 30
# [6] => 36
# [] => 0
# Робити запит на введення даних від користувача не потрібно
lst = [6]
# скористаємось додатковим  списком щоб застосувати функцію sum до його елементів
ls_rez = []
index = 0
for ls in lst:
    if not index % 2:
        ls_rez.append(ls)  # заносимо елемети із парним індексом в результуючий список
    index += 1
# на той випадок коли початковий список буде пустий,
# щоб уникнути помилки при спробі доступу до останнього елементу
if not (len(lst)):
    print(0)
else:
    print(sum(ls_rez)*lst[-1]) # скористаємось від'ємним -1 значенням для зручного доступу
    # до останнього елементу списку
