# Домашня робота № 2 з курсу Phython Basic,
# Написати програму, яка просить користувача ввести 4-х значне число з клавіатури,
# після чого друкує на екрані стовпчик цифр, з якого це число складається.
# Наприклад, користувач вводить 1234, а програма виводить:
# 1
# 2
# 3
# 4
# Завдання необхідно вирішити, використовуючи методи поділу (підказка // і % або divmod).
# Виведення в стовпчик можна зробити за допомогою 4-х функцій print.
# Користувач може ввести будь-яке 4 значне ціле число.
# Будь-яке 4-х значне число - це число, яке складається з 4-х цифр,
# де кожна цифра може бути від 0 до 9 включно.

num = int(input("Введіть чотиризначне число :"))
x, y = divmod(num, 1000)  # ф. divmode(x,y) повертає два значення - х результат цілочисельного ділення і у остачу
                          # від цілочисельного ділення (кількість тисяч  - щоб дістати саму крайню літеру зліва
print(x)                  # чотиризначного числа num ) із виводим на єкран
x, y = divmod(y, 100)     # використовуючи  минулий резу-т остачі від ділення в змінній y (від початкового  числа
                          #  там лишилася  трьохзначна остача) - повторюємо минулу операцію із сотками
print(x)                  # результат цілочисельного ділення (кількисть соток - сама крайня цифра зліва) виводим
print(y // 10)            # після минулої  операції  де у змінній y залишилось 2 ві цифри
                          # застосовуємо безпосередньо оператор // цілочисельного ділення (виділивши ліву частину
                          # числа)із виводом на єкран
print(y % 10)             # те саме число у але тепер застосуємо оператор % взяття остачі від ділення
                          # (щоб дістати праву частину двохзначного числа) із безпосереднім виводом на єкран
