# Користувач вводить рядок. Ваше завдання - перевірити, чи може цей рядок бути ім'ям змінної.
# Змінна не може:
# 1) починатися з цифри,
# 2) складатися тільки з цифр,
# 3) містити великі літери, пропуск і знаки пунктуації (взяти можна тут string.punctuation),
#       окрім нижнього підкреслення "_".
# 4) бути жодним із зареєстрованих слів.
# 5) При цьому ім'я змінної може складатися тільки з одного нижнього підкреслення "_".
# Список зареєстрованих слів можна взяти із keyword.kwlist.
# У результаті перевірки на друк виводиться або True, якщо таке ім'я змінної допустимо, або False - якщо ні.
# Приклади імен змінних та результат перевірки (=> на друк виводити не потрібно )
# а) _ => True
# б) x => True
# в) get_value => True
# г) get value => False
# д) get!value => False
# є) some_super_puper_value => True !!!Цей приклад суперечіть п.5 умови задачі!!!!
# ж) Get_value => False
# з) get_Value => False
# к) getValue => False
# і) 3m => False
# л) m3 => True

import keyword
import string
val_str = input("Введіть ім'я змінної \n")
lst_digits = ['0', '1', '2', '3', '4', '5', '6', '7', '8', '9']
result = True
if len(val_str):
    if (              val_str.isdigit()| #чи складається змінна із цифр (див. п.2 умов. завдання)
            (val_str[0] in lst_digits) | # чи перший символ є цифрою (див.п.1 умов. завдання)
            (val_str in keyword.kwlist)| # чи не є  жодним із зареєстрованих слів (див. п.4)
           ((val_str.count('_')>1))      # чи складається ім'я змінної  тільки із одного підкреслення "_"
      # (див. п.5). Зокрема це суперечіть прикладу  із п. є! Зверніть увагу!
       ):
        result = False
    for ch in val_str:
        if (((ch in string.punctuation) and (ch != '_')) or  # чи містить ім'я змінної знаки пунктуації,
                                               ch == " " or #  пропуски,
                                             ch.isupper() #  великі літери
           ):
            result = False
print(result)
