# Домашня робота №20 "Додати 1 до числа" з курсу "Python Basic"
# Завдання — написати функцію add_one, яка приймає список із цифр,
#   які у свою чергу є одним числом. До нього необхідно додати 1.
#   Тобто. Необхідно з набору цифр, що входять до списку, отримати число,
#   скласти його з 1 і отриману суму, знову розбити на список із цифр.
#   В результаті функція повертає список із цифр, що становлять значення суми.
# Приклад:
#   Так зі списку з цифрами [1, 2, 3, 4], має вийти число 1234. До нього додаємо 1,
#   і отримуємо 1235. Після цього потрібно розбити отримане число на складові цифри.
#   У результаті має бути список [1, 2, 3, 5], який повертає функція.

def add_one(some_list):
    # перетворимо список цифр some_list в список рядків із метою застосування ф. join()
    # що поєднае всі єлементи списку в один рядок  num
    num_str_list = [str(dig_lst_elem) for dig_lst_elem in some_list]
    num = ''.join(num_str_list)
    # далі перетворимо рядок в цифру і додамо  1 (згідно умові з.)
    # щоб повернути список  цифр:
    #        - перетворимо отриманий результат в рядок
    #        - із отриманого рядка створимо список буквб
    #         що роз'днає цифру на окремі складові в списку
    #        - отриманий список символів(цифрових)
    #        перетворюемо на цифри і повертаємо
    return [int(num_str) for num_str in list(str(int(num) + 1))]


assert add_one([1, 2, 3, 4]) == [1, 2, 3, 5], 'Test1'
assert add_one([9, 9, 9]) == [1, 0, 0, 0], 'Test2'
assert add_one([0]) == [1], 'Test3'
assert add_one([9]) == [1, 0], 'Test4'
print("ОК")
