# Домашня робота №15 "Конвертер із числа в дату" з курсу "Python Basic"
#  Завдання — написати програму, яка переводить число у формат часу у читальному вигляді.
#   - Користувач повинен ввести число більше або дорівнює 0 і менше ніж 8640000.
#   - Число, яке є кількістю секунд, необхідно перевести в дні, години, хвилини та секунди.
#   Додатковим завданням є виведення:
#   Слово "день" підбирається на основі кількох днів,
#   а години, хвилини і секунди повинні заповнюватися нулями при одноцифрових значеннях.
# Приклад:
#       0 -> 0 днів, 00:00:00
#       224930 -> 2 дні, 14:28:50
#       466289 -> 5 днів, 09:31:29
#       950400 -> 11 днів, 00:00:00
#       1209600 -> 14 днів, 00:00:00
#       1900800 - > 22 дні, 00:00:00
#       8639999 -> 99 днів, 23:59:59
#       22493 -> 0 днів, 06:14:53
#       7948799 -> 91 день, 23:59:59
# Використовуючи функцію divmod або методи поділу // і %
# необхідно знайти відповідну кількість днів, годин, хвилин, а те що залишиться - це секунди, які менше 60
# Доповнити провідними нулями можна за допомогою методу zfill()
days_title = {1: 'день', 2: 'дні', 3: 'дні', 4: 'дня'}
seconds = int(input('Введіть число (кількість секунд): \n'))
if 0 <= seconds < 8640000:
    days, seconds = divmod(seconds, (60 * 60 * 24))
    hours, seconds = divmod(seconds, 60 * 60)
    minutes, seconds = divmod(seconds, 60)
    print(
     days, ' ', days_title.get(('днів' if 5 < days < 21 else days % 10), 'днів'), ', ',
     str(hours).zfill(2), ':',
     str(minutes).zfill(2), ':',
     str(seconds).zfill(2), sep=''
    )
